app/controllers/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def create
    @channel = Channel.new(channel_params)

    respond_to do |format|
      if @channel.save
---
INSERT INTO "channels" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "CC"], ["description", ""], ["created_at", "2020-05-01 08:08:09.672747"], ["updated_at", "2020-05-01 08:08:09.672747"]]

    def set_channel
      @channel = Channel.find(params[:id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]