app/controllers/tv_shows_controller.rb

SELECT "tv_shows".* FROM "tv_shows"
---
  def index
    @tv_shows = TvShow.all

INSERT INTO "tv_shows" ("name", "description", "days", "status", "channel_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @tv_show = TvShow.new(tv_show_params)

    respond_to do |format|
      if @tv_show.save

SELECT  "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tv_show
      @tv_show = TvShow.find(params[:id])